app/views/posts/_form.html.erb

SELECT "areas".* FROM "areas"
---
    <%= f.label :area_id, class: "block text-sm font-medium text-gray-700" %>
    <%= f.collection_select :area_id, Area.all, :id, :name, { prompt: "エリアを選択してください" }, { class: "mt-1 block w-full rounded-md border-gray-300 shadow-sm focus:border-indigo-300 focus:ring focus:ring-indigo-200 focus:ring-opacity-50" } %>