app/controllers/posts_controller.rb

    def index
      @posts = Post.all.includes(:user).order(created_at: :desc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC